results/baseline/baseline-20260916-qwen3.8-27b-c1.raw.txt
# 命令（用户提供）:
# python -m sglang.bench_serving \
#     --dataset-name generated-shared-prefix --backend sglang \
#     --host 127.0.0.1 --port 6688 \
#     --gsp-num-groups 1 --gsp-prompts-per-group 20 \
#     --gsp-system-prompt-len 57600 --gsp-question-len 6400 --gsp-output-len 1000 \
#     --max-concurrency 1 --num-prompts 20 --request-rate inf

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 1
Successful requests:                     20
Benchmark duration (s):                  305.10
Total input tokens:                      1369687
Total input text tokens:                 1369687
Total generated tokens:                  20000
Total generated tokens (retokenized):    19670
Request throughput (req/s):              0.07
Input token throughput (tok/s):          4489.29
Output token throughput (tok/s):         65.55
Peak output token throughput (tok/s):    73.00
Peak concurrent requests:                2
Total token throughput (tok/s):          4554.84
Concurrency:                             1.00
Accept length:                           3.86
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   15253.65
Median E2E Latency (ms):                 14580.97
P90 E2E Latency (ms):                    16568.28
P95 E2E Latency (ms):                    19010.94
P99 E2E Latency (ms):                    20078.23
---------------Time to First Token----------------
Mean TTFT (ms):                          986.91
Median TTFT (ms):                        588.17
P90 TTFT (ms):                           2251.54
P95 TTFT (ms):                           2612.16
P99 TTFT (ms):                           4399.44
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.28
Median TPOT (ms):                        13.97
P90 TPOT (ms):                           14.30
P95 TPOT (ms):                           14.78
P99 TPOT (ms):                           18.78
---------------Inter-Token Latency----------------
Mean ITL (ms):                           14.28
Median ITL (ms):                         13.79
P90 ITL (ms):                            14.00
P95 ITL (ms):                            14.18
P99 ITL (ms):                            27.72
Max ITL (ms):                            59.48
==================================================